[Language]
Code="ar-SA"
Name="العربية"
Translator="Sameer Masrahi سمير مسرحي <ameer456@mail.net.sa>"
Dir="rtl"

[MainFrame]
Title="Lingoes"
Close="خروج"
Maximize="تكبير"
Minimize="تصغير"
Restore="استعادة"
Menu="القائمة الرئيسية"

; Status Icon
[NotifyIcon]
Tip="Lingoes مترجم\nترجمة المؤشر = [$CursorStatus]\nZoned Word Translator: [$SelectionStatus]\nترجمة الحافظة: [$ClipboardStatus]"
InfoTitle="Lingoes مترجم"
Info="ترجمة المؤشر = [$CursorStatus]\nZoned Word Translator: [$SelectionStatus]\nترجمة الحافظة: [$ClipboardStatus]"
Enabled="مفعلة"
Disabled="معطلة"

[MainMenu]
Open="فتح"
CursorTranslator="ترجمة المؤشر"
SelectionTranslator="Zoned Word Translator"
ClipboardTranslator="ترجمة الحافظة"
Configuration="إعدادات..."
Dictionaries="القواميس..."
Activation="تفعيل المنتج"
UpdateOnline="تحديث بالإنترنت"
Help="مساعدة"
About="عن Lingoes"
SupportOnline="الدعم الفني"
Exit="خروج"

[DlgInput]
Back="عودة"
Forward="الأمام"
MainMenu="القائمة الرئيسية"
HistoryList="قائمة محفوظات البحث"
Search="بحث", "بحث بتفاصيل توضيحية"
WebSearch="البحث في الويب"
AutoMatch="مطابقة تلقائية", "المطابقة التلقائية في القواميس المثبتة"
MatchSetup="خيارات القواميس المثبتة..."
FindEngine="احصل على المزيد من المحركات..."

[DlgIndex]
Index="القاموس"
Guide="الدليل"
Appendix="الملحق"
NoIndex="بدون فهرسة"
AddIndexGroup="<div style=\"margin: 10; font-family: '[$TextFont]'; font-size: [$TextFontSize]pt\">إضافة قاموس <b>للقواميس المثبتة</b>, يمكنك الحصول على تلميح خلال كتابة الكلمة.<br/><br/><a href=\"app://dictionary_group/[$IndexGroupID]\"><u>لإدارة القواميس المثبتة, إضغط هنا.</u></a></div>"

[WebGuide]
Results="النتائج"
Spelling="بدائل التهجئة"
Appendices="الملاحق"
Options="خيارات"
Dictionaries="قواميس...", "إدارة القواميس"
Configuration="إعدادات...", "فتح نافذة الاعدادات"
Help="Help", "فتح Lingoes مساعدة"
Homepage="lingoes.net", "زيارة الموقع الرسمي للبرنامج"
Community="Lingoes Community", "Lingoes Online Community"

[DlgStatus]
KeepVisible="اجعل النافذة دائمـًا في المقدمة"

[DlgView]
Speak="إنطقها", "نطق الجملة المحددة"
Search="بحث"
Copy="نسخ"
Print="طباعة..."
Save="حفظ..."
Find="بحث..."
SelectAll="تحديد الكل"
TextTranslate="ترجمة النصوص", "إلى ترجمة النصوص"
StartPage="", "Start Page"
ShowIndex="إظهار الشريط الجانبي"
HideIndex="إخفاء الشريط الجانبي"
SaveFilter="HTML ملف (*.htm; *.html)|*.htm;*.html|"
SpeechOption="خيارات التحدث..."
SelectVoice="اختيار الصوت"
Activation="Lingoes تفعيل البرنامج", "معالج تفعيل"

[DlgInfo]
Title="رسالة"
Ok="موافق"
Cancel="إلغاء"
Yes="نعم"
No="لا"
Retry="إعادة"
Abort="إحباط"
Ignore="تجاهل"

[DlgAuthentication]
Title="الاتصال بـ "
TitleProxy="الاتصال باستخدام ملقم الوكيل (البروكسي) "
Username="اسم المستخدم:"
Password="كلمة المرور:"
Remember="تذكر كلمة المرور"
Ok="موافق"
Cancel="إلغاء"

[WndGrab]
Open="بحث بالتفاصيل التوضيحية"
Speak="إنطقها"
Copy="نسخ"
TextTranslation="ترجمة النص"
KeepSize="احتفظ بمقاس النافذة"
KeepVisible="إجعل النافذة دومـًا في المقدمة"
Back="عودة"
Forward="الأمام"
Search="بحث\n  Enter:\t\tبحث\n  Ctrl + Enter:\tبحث بالتفاصيل التوضيحية\n  Shift + Enter:\tترجمة النص\n  Alt + Enter:\tالبحث في الويب"

[DlgDictOption]
Title="خيارات القاموس"
NetInstall="تثبيت من Lingoes", "تثبيت قاموس من الموقع الرسمي"
Install="تثبيت", "تثبيت من القرص"
Uninstall="إلغاء التثبيت", "إلغاء تثبيت القاموس"
Add="إضافة", "إضافة قاموس للقائمة"
Remove="حذف", "حذف هذا القاموس من القائمة"
Download="تنزيل", "تنزيل هذا القاموس للاستخدام في وضع العمل من دون اتصال"
MoveTop="", "تحريك للمقدمة"
MoveUp="", "تحريك للأعلى"
MoveDown="", "تحريك للأسفل"
MoveBottom="", "تحريك للمؤخرة"
MoreDetails="", "عرض تفاصيل القاموس"
Close="إغلاق"

Installed="القواميس المثبتة"
Query="القواميس المثبتة"
Index="القاموس"
Grab="مترجم مؤشر الفأرة"

InstalledList="القواميس المثبتة"
QueryList="القواميس المثبتة"
IndexList="قائمة القواميس"
GrabList="قائمة تراجم مؤشر الفأرة"
DictID="ID"
Online="على الإنترنت"

Type="النوع"
OnlineType="طلب اتصال بالإنترنت"
AddFilter="قواميس Lingoes (*.ld2, *.ldp)|*.ld2;*.ldp|"
InstallDict="تثبيت قاموس"
Installing="جاري التثبيت..."

[DlgDictList]
Title="إضافة قواميس"
Add="إضافة"
Cancel="إلغاء"
Select="إختيار"
DictList="القواميس المثبتة"
ID="ID"
Online="على الإنترنت"

[DlgDictInfo]
Title="تفاصيل القاموس"
Close="حسنـًا"

ID="ID"
MD5="MD5"
Name="الاسم"
Version="النسخة"
Date="تاريخ الإنشاء"
Update="آخر تحديث"
IndexCount="إجمالي الكلمات"
GlsCount="إجمالي المصطلحات"
DictTitle="العنوان"
DictEdition="تحرير"
DictDescription="وصف"
PubAuthor="الكاتب"
PubEmail="بريد الكتروني"
PubWebsite="Website"
PubCopyright="حقوق النسخ"
Filename="اسم الملف"

; Install Dictionaries
[DlgDictInstall]
Title="تثبيت قاموس"
InstallSucceed="نجاح تثبيت القاموس \"[$DictTitle]\""
DictGroupOption="خيارات"
AddIndexGroup="إضافة إلى  \"القاموس\""
AddIndexGroupDesc="سيقوم البرنامج بالبحث في القواميس المختارة (في القاموس) ويعرض أقرب نتيجة خلال كتابة الكلمة"
AddGrabGroup="إضافة إلى \"مترجم مؤشر الفأرة\""
AddGrabGroupDesc="سيقوم البرنامج بالبحث في القواميس المختارة (في قائمة تراجم مؤشر الفأرة) خلال تمريرك لمؤشر الفأرة على الكلمة المرغوبة ويعرض نتيجة الترجمة في نافذة صغيرة أسفل المؤشر."
Ok="موافق"

; Configuration
[DlgOption]
Title="الإعدادات"
Ok="موافق"
Cancel="إلغاء"
General="عام"
Appearance="المظهر"
Connection="الاتصال"
Speech="النطق الصوتي"
Hotkey="الاختصارات"
Translate="الترجمة"
License="التراخيص"

; General
[DlgOptGeneral]
Language="اللغة"
UILanguage="لغة الواجهة"

WebSearch="البحث في الويب"
SelectWebSearch="إختر محرك البحث المرغوب"

TermHistory="قائمة محفوظات البحث"
SaveHistory="أقصى عدد للكلمات المحفوظة"
ClearHistory="مسح القائمة"
ClearHistoryConfirmation="هل ترغب فعلاً في مسح القائمة؟"

AutoStart="تشغيل تلقائي للبرنامج عند تسجيل الدخول للويندوز"
StartMin="تصغير البرنامج عند تشغيله"

; Appearance
[DlgOptAppearance]
UserInterface="واجهة المستخدم"
WindowStyle="شكل النافذة"
WindowFont="خطوط النافذة"
WindowFontSize="مقاس الخط"
WindowFontSizeList="7", "8", "9", "10", "10.5", "11"
ResultDisplay="عرض النتيجة"
TextFont="الخط"
TextFontSize="مقاس الخط"
TextFontSizeList="7", "8", "9", "10", "10.5", "11", "12", "13", "14", "16", "18", "20", "22", "24", "26", "28", "32", "36", "48"
PhoneticFont="الخط الخاص بطريقة لفظ الكلمة"
CursorTranslatorBar="نافذة ترجمة المؤشر"
FontColor="لون الخط"
BackColor="لون الخلفية"
BorderColor="لون الحدود"
Transparence="مقدار الشفافية لنافذة ترجمة المؤشر"
SampleText="ترجمة المؤشر"

[Style]
0="بدون"
1="الشكل القياسي"

; Translate
[DlgOptTranslate]
SupportLCMap="Support local language mapping"

; Capture
[DlgOptCapture]
CursorActivation="ترجمة المؤشر"
MouseActivation="أسلوب تفعيل الترجمة:"
MouseOver="التأشير بالفأرة"
LeftMouseButton="زر الفأرة الأيسر"
MiddleMouseButton="زر الفأرة الأوسط"
RightMouseButton="زر الفأرة الأيمن"
MouseXButton1="زر الفأرة الإضافي 1 (إن وجد)"
MouseXButton2="زر الفأرة الإضافي 2 (إن وجد)"
TimeDelay="مهلة العرض:"
MSEL="ملـّي ثانية"
Language="خيارات اللغة"
IgnoreLatin="تجاهل اللاتينية (إنجليزي، فرنسي، ألماني، إسباني،.. الخ.)"
IgnoreCJK="تجاهل: الصينية - اليابانية - الكورية"
IgnoreCyrillic="تجاهل السلافية Cyrillic (الروسية، البلغارية، الأوكرانية،.. الخ.)"
IgnoreArabic="تجاهل العربية، العبرية"
SupportLCMap="Support local language mapping"
InstallAdobePlugin="Install Adobe Acrobat/Reader Plug-in"
ZonedWord="Zoned Word Translator"
ZonedWordFilterRule="Zoned Word Filter Rules..."

; Speech
[DlgOptSpeech]
Engine="محرك قراءة النصوص Text-to-Speech(TTS)"
Voice="الأصوات"
Volume="درجة الصوت"
Pitch="النغمة"
Speed="السرعة"
RealtimePron="لفظ فوري للكلمة (خلال الترجمة بالتأشير أو القاموس)"
Test="Test"
EnterText="ادخل نص لتجربة الصوت (لابد من دعم المحرك للغة الإدخال)"

; Connect
[DlgOptConnection]
ConnectSet="إعدادات الإتصال"
DirectConnect="إتصال مباشر"
IEProxyConnect="إستخدام إعدادات ملقم الوكيل من متصفح الإنترنت"
ProxyConnect="الإتصال عن طريق ملقم الوكيل / الجدار الناري"
ProxyServer="ملقم الوكيل (البروكسي):"
ProxyPort="المنفذ:"
Username="اسم المستخدم:"
Passwoِrd="كلمة المرور:"
OnlineUpdate="تحديث البرنامج"
UpdateNow="تحديث الآن"
EnableUpdate="تفعيل التحديث بواسطة الإنترنت"

; Hotkey
[DlgOptHotkey]
OpenMainWnd="فتح نافذة البرنامج الرئيسيةِِِ"
GrabToggleKey="تفعيل/تعطيل ترجمة المؤشر"
ClipboardToggleKey="تفعيل/تعطيل ترجمة الحافظة"
Pronounce="اللفظ"
CopyInterpretation="نسخ المحتويات لمنطقة الترجمة"

[DlgExpire]
Title="إنتهى فترة تجربة Lingoes"
Ok="قم بالترقية الآن"
Cancel="خروج"
NetworkSettings="إعدادات الشبكة"
Support="Lingoes.net"
AskUpgrade="لقد انتهت فترة التجربة للنسخة الحالية، لابد من الترقية لنسخة جديدة يمكنك استعمالها! \nالترقية لنسخة جديدة؟"

[DlgAbout]
DlgTitle="عن Lingoes"
Version="الإصدارة: "
PortableEdition="Portable Edition"
Email="البريد الإلكتروني"
Website="موقع Lingoes على الإنترنت"
LicenseTo="هذا المنتج مرخص لـ:"
LicenseID="ID: "

[WebResult]
SpellingAlternatives="بدائل التهجئة"
SpellChecker="تفحص التهجئة"
TextTranslation="ترجمة النص"
WebSearch="البحث في الويب"
MoreResults="المزيد من النتائج"
WaitSearch="طلب نتيجة البحث..."
NoMatch="<div id='dict_result_nomatch' style=\"font-family:'[$TextFont]'; font-size:[$TextFontSize]pt; line-height:normal; padding:10; display:[$Display]\"><b>ليست هناك تعابير مطابقة لــ: \"<font color='#C00000'>[$SearchKey]</font>\".</b></div>"

[WebStartPage]
StartPageTpl="<table id='startpage' width='100%' height='100%' border='0' cellspacing='0' cellpadding='10' onselectstart='return false'><tr><td align='center' style=\"font-family: '[$Font]'; font-size: [$FontSize]pt; line-height: 1.2em\"><a href='app://homepage/'><img border='0' src='[$ImgPath]logomain.png' width='134' height='40' style='margin-bottom:50'></a></td></tr></table>"
HelpTip="كيف تستخدم Lingoes"
DownDictTip="تحميل المزيد من القواميس"
Intro="ترجمة (من و إلى) أكثر من 80 لغة<br>ترجمة بالتأشير - ترجمة نصوص - قرائة النصوص"

[TextTranslation]
Title="ترجمة النص"
To="إلى"
Translate="ترجمة"
RequestFailed="فشلت عملية طلب نتيجة الترجمة."
ConnectFailed="لم يستطع Lingoes الاتصال بالخادم، إن كنت متصلاً بالإنترنت فضلاً تفحص إعدادات الاتصال الموجودة في قائمة الإعدادات، وقم بالسماح للبرنامج بالاتصال إن كنت تملك جدار ناري Firewall."
WaitRequest="يتم الآن طلب نتيجة الترجمة..."
ParseResultFailed="فشلت عملية تحليل نتيجة الترجمة. إذا واجهتك هذه الرسالة عدة مرات، فضلاً قم بإعلامنا."

; Layout
[Layout]
DictMenu="قائمة القاموس"
ShowResult="عرض النتيجة"
MinimizeResult="تصغير النتيجة"
FindWord="بحث: "

; Dictionary Menu
[DictMenu]
About="عن..."
Enable="تفعيل"
Disable="تعطيل"
DisableMsg="القاموس معطل ولن يظهر نتائج!\nيمكنك تفعيله من خلال قائمة \"القواميس\"."
MoveTop="عرض النتيجة في المقدمة"
ArrangeResults="ترتيب النتائج..."
IndexGroup="  (القاموس)"
QueryGroup="  (القواميس المثبتة)"
GrabGroup="  (مترجم مؤشر الفأرة)"

[Update]
Title="تحديث البرنامج"
AskUpgrade="تم الكشف عن نسخة جديدة. هل تريد التحديث للنسخة الجديدة؟"
UpgradeNow="تم الكشف عن نسخة جديدة. تحتاج إلى التحديث لهذه النسخة الجديدة"
UpdateSuccess="تم التحديث بنجاح!"
UpdateFail="فشل التحديث!"
NoUpdate="النسخة الحالية هي آخر نسخة"

CheckUpdate="Checking update..."
GetUpdateInfo="Getting updated information..."
DownUpdateData="Downloading updated data..."
ExecUpdate="Updating system..."
GetUpgradeInfo="Getting upgraded information..."
DownUpgradeData="Downloading upgraded data..."
ExecUpgrade="Upgrading system..."
NeedExitForUpgrade="Lingoes will quit for finishing upgrade"

[Message]
InitUpdateServerFail="فشلت تهيئة خدمة التحديث التلقائي "
StartDictServerFail="فشل تشغيل خدمة القاموس"

DictFileErr="خطأ في نوع الملف!\n[$Filename]"
DictVersinTooOld="[$Filename]\nالنسخة الحالية للقاموس ([$DictVer]) قديمة، فضلاً قم بتحديثها.\n\nهل تريد زيارة موقع Lingoes لبحث آخر نسخة؟"
DictVersinTooNew="[$Filename]\nالنسخة الحالية للقاموس ([$DictVer]) تحتاج لنسخة أعلى من برنامج Lingoes..\n\nهل تريد تحميل آخر نسخة من موقع البرنامج الرسمي الآن؟"

AskDictRepeatInstall="قائمة القواميس تحتوي بالفعل على القاموس \"[$DictTitle]\",\nهل تريد الإستمرار؟"
InstallDictFail="فشل تثبيت القاموس:\n[$Filename]"
AskUninstall="هل أنت متأكد من رغبتك في إلغاء تثبيت هذا القاموس؟\n\n[$DictTitle]\nID: [$DictID]"
UninstallDictFail="فشل إلغاء تثبيت القاموس\n\n[$DictTitle]\nID: [$DictID]"
AskRemoveFromGroup="هل أنت متأكد من رغبتك في حذف القاموس \"[$DictTitle]\" من القائمة؟"

MemoryAllocFail="فشل تخصيص ذاكرة."
FilenameInvalid="اسم ملف غير صالح."

AreYouAbort="هل أنت متأكد من إلغاء العملية؟"
CreateThreadFail="فشل إنشاء تشعب للبرنامج"
CreateEventFail="فشل كتابة العارض"
Unfulfilment="الميزة غير منجزة بعد"
OnlyProVersion="هذه الميزة لنسخة Pro فقط"
NoRegister="هذه نسخة غير مسجلة، فضلاً قم بتسجيل Lingoes لإستخدام الميزة."
UsernameIsEmpty="اسم المستخدم فارغ، فضلاً قم بتعبئته مرة أخرى."
SaveSearchResultFail="فشلت عملية حفظ نتيجة البحث."

OpenAppendixFail="فشلت عملية فتح محتويات الملحق."
OpenSpeechEngineFail="فشل تحميل معالج قراءة النصوص TTS ، فضلاً تأكد من تثبيته في جهازك! \n\nلابد من تثبيت معالج قراءة النصوص TTS في نظامك ليتم تشغيله. إن لم يكن مثبت، فضلاً قم بتنزيله وتثبيته من موقع Lingoes \n\nهل ترغب بتنزيله الآن؟"

; NeedIE6Support="يحتاج برنامج Lingoes لمتصفح إنترنت اكسبلورر النسخة 6 أو أعلى، فضلاً قم بتحديث المتصفح للنسخة 6 أو أعلى"
NoImplement="معذرة، الميزة غير منجزة بعد"
